test-cases/nose-cone-pisoFoam-trial-1/noseCone/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.24;

boundaryField
{
    left
    {
        type            fixedValue;
        value           uniform 0.24;
    }

    right
    {
        type            inletOutlet;
        inletValue      uniform 0.24;
        value           uniform 0.24;
    }

    bottom
    {
        type            kqRWallFunction;
        value           uniform 0.24;
    }

    nose
    {
        type            kqRWallFunction;
        value           uniform 0.24;
    }

    top
    {
        type        zeroGradient;
    }

    "(front|back)"
    {
        type        zeroGradient;
    }

    "proc.*"
    {
        type            processor;
    }
}


// ************************************************************************* //
